content/post/emacs_configuration.md
+++
title = "Emacs"
author = ["Zenith John"]
publishDate = 2021-08-19
tags = ["Computer"]
draft = false
showtoc = true
+++

## 版本 {#版本}

Emacs 是我最常用的编码工具。我使用的是 Emacs 27 版本，自己编译，编译选项为

```bash
./configure --with-dbus --with-gif --with-jpeg --with-png --with-rsvg --with-tiff --with-xft --with-xpm --with-xml2 --with-xwidgets --with-modules --with-native-compilation --with-pgtk --with-json --with-mailutils CFLAGS="-O3 -mtune=native -march=native -fomit-frame-pointer"
```


## 配置文件主体 {#配置文件主体}

对于新手而言，不建议自己从头开始配置。因为很有可能会迷失在配置文件之中，建议先使
用其他人的配置，同时通过学习其他人的代码来进行学习，在一定时间之后再逐渐积累形成
自己的配置。就我个人而言最开始使用的是purcell的配置文件。
<https://github.com/purcell/emacs.d> 又尝试了Spacemacs，
<https://github.com/syl20bnr/spacemacs>, 但是由于Spacemacs启动速度过慢，同时有过多
的冗余设置，加入自己的配置也不够方便，因此，开始了自己的配置。从各个repo中抄了很
多的代码，途中也学习了不少关于Emacs和Lisp的知识。最近发现了
Doom-emacs,<https://github.com/hlissner/doom-emacs/>。 相比于Spacemacs，Doom-emacs
启动较快，同时利用Doom-emacs提供的各种宏，能够更好地在不改变原始仓库代码的同时进
行配置。 ~~目前我的配置就建立在Doom-emacs的基础上~~ 。目前我已经重新使用完全由自己
编码的配置来换取精确的控制。就我现在来看，我更加推荐 Purcell 的配置，并从他的配
置中逐步学习。这是因为他的配置额外的结构较少，不容易像学习 spacemacs 一样陷入配
置的重重引用中。


## 好的字体是成功的一半 {#好的字体是成功的一半}

推荐字体 **更纱黑体** ，中英文等宽等高避免Org-mode的各种错位。虽然个人感觉英文字体
没有那么好看，但还是可以接受的。(中文还是非常漂亮的)附链接:[Sarasa Gothic](https://github.com/be5invis/Sarasa-Gothic)

可以这样配置（中文使用更纱黑体，英文使用 Iosevka 与 Source Code Pro 的混合）：

```emacs-lisp
(defvar zenith-font (font-spec :family "Iosevka Term SS09" :size 16 :weight 'semi-bold))
(defvar zenith-unicode-font (font-spec :family "Sarasa Term SC" :weight 'bold))
(setq inhibit-x-resources t)

(defun zenith/init-font ()
  (add-to-list 'default-frame-alist `(font . ,(font-xlfd-name zenith-font)))
  (set-fontset-font t 'unicode zenith-unicode-font nil 'prepend))

(zenith/init-font)
```

在GTK环境中，EMACS在打开后会根据GConf重新设置字体格式，因此要有效的设置字体必须在.emacs或者init.el中加入

```emacs-lisp
(define-key special-event-map [config-changed-event] 'ignore)
```

更具体的说明请看<https://emacs.stackexchange.com/questions/32641/something-changes-the-default-face-in-my-emacs/32664#32664>


## Writeroom-mode and others {#writeroom-mode-and-others}

至少在Ubuntu 18.04中，这些使文字居中的模式(Writeroom )不能够很好地与ibus协作，
ibus的选单会发生偏移。原因和解决方案有待进一步观察。（目前我已经使用
darkroom-mode 但是会遇到同样的问题）

事实上，这个问题可以使用 Emacs 的内置输入法来解决。但是内置输入法太弱，因此我们
使用 <https://github.com/tumashu/pyim> 。事实上，pyim 除了输入法外还提供了很多非常
有用的功能。比如根据环境切换中英文状态，比如将英文字符串转变为输入法的输入等。配
置可以参考我的 config/init-pyim.el 。其中我使用的 pyim 后端是 rime， rime 是一个
非常好用的输入法。


## 在Emacs中使用使用Microsoft Python Language Server {#在emacs中使用使用microsoft-python-language-server}


### Why {#why}

目前来看 Microsoft 的 Python Language Server 由于使用 C# 写成，因此速度最快，卡顿较少，补全效果较好。


### How {#how}

主要的过程都在这篇文章之中：<https://vxlabs.com/2018/11/19/configuring-emacs-lsp-mode-and-microsofts-visual-studio-code-python-language-server/> ,但是有必要对于一些步骤进行改进。

首先在代码中对于 lsp-ui-sideline--format-info 和 lsp-ui-doc--extract 这两个函数添加了 advice，而这advice在输入的 doc 为 nil 时会报错，因此在ccls时这两个函数不能够正常工作，因此需要添加 (when doc ……) 这样的判定条件才能够保证其正确性。
另一方面，在我的电脑上，python language server 在补全时会加入一些莫名其妙的东西。在字符较短时，会列出所有的关键字(不知道为什么)。因此需要修改 company-transformers 为了保证模糊匹配的效果，加入了 company-flx-transformer 来对所获得的序列进行排序。效果尚可。


### 补充 {#补充}

~~由于目前emacs的lsp-mode速度较慢，因此我在使用Doom-emacs并没有开启lsp选项~~ 。 目前
我使用的是 nox 是 eglot 的阉割版，自动支持 mspyls。


## Org-mode {#org-mode}


### 一些有用的功能 {#一些有用的功能}

首先就是 [org-bullets](https://github.com/sabof/org-bullets)
还有就是为了配合 ivy 等补全工具设置

```emacs-lisp
(setq org-outline-path-complete-in-steps nil
      org-goto-interface 'outline-path-completion)
```

放大 latex preview 的公式，并让公式背景与主体适应：

```emacs-lisp
(setq org-format-latex-options (plist-put org-format-latex-options :scale 1.5))
(setq-default
 org-format-latex-options
 (plist-put org-format-latex-options
            :background
            (face-attribute (or (cadr (assq 'default face-remapping-alist))
                                'default)
                            :background nil t)))
```

在字体使用粗体时，emphasis 的效果加粗无法很好的显示出来。因此我通过配置
org-emphasis-alist改变了原来应该加粗的字体的颜色，并使得能够这一效果可以换行。代码如下：

```emacs-lisp
(add-to-list 'org-emphasis-alist
             '("*" (:foreground "pink")))
(setcar (nthcdr 4 org-emphasis-regexp-components) 4)
(org-set-emph-re 'org-emphasis-regexp-components org-emphasis-regexp-components)
```

还有很多细碎的小配置就不赘述了。


### Org mode Easy Templates {#org-mode-easy-templates}

在 Org-mode 9.2 中，easytemplate的使用方式发生了改变。从 `<s <TAB>` ;变成了 ~C-c C-,~ 。
不得不说 Org-babel 是个很好用的功能，可以探索一下。


### org-refile {#org-refile}

由于我个人倾向于将笔记放在一起，因此使用了一个笔记本文件夹，为了使得 refile 能够
与此配合需要一些配置。

```emacs-lisp
(defun zenith/refile-targets-notes ()
  (directory-files zenith/note-directory t ".*\\.org\\'"))

(setq-default org-refile-targets
              '((nil :maxlevel 3)
                (org-agenda-files :maxlevel 3)
                (zenith/refile-targets-notes :maxlevel 3)))
```
