src/Public.org
*** GTD
Emacs Org-mode 的一个卖点就是 GTD。其中需要 org-agenda, org-capture, org-tags 等
部分互相配合。关于关键词可以参考，在 Tag 中创建了一个 Group Must 来管理不得不做
的一些事的 Tag：
#+begin_src emacs-lisp
(setq org-todo-keywords
      '((sequence "TODO(t)" "WAITING(w@/!)" "PAUSE(p)" "SOMEDAY(s)" "NEXT(n)" "|" "DONE(d!)" "CANCELLED(c@)")
        (sequence "[ ](T)" "[-](P)" "[?](m)" "|" "[X](D)"))
      org-todo-keyword-faces
      '(("[-]" :inherit (font-lock-constant-face bold))
        ("[?]" :inherit (warning bold))
        ("WAITING" :inherit bold)
        ("LATER" :inherit (warning bold))))

(setq org-capture-templates
      '(
        ("h" "Homework" entry (file+headline "~/Dropbox/task.org"  "Homework")
         "* TODO %? :Homework:\n")
        ("s" "Schedule" entry (file+headline "~/Dropbox/task.org" "Schedule")
         "* %?\n")
        ("r" "Project" entry (file+headline "~/Dropbox/task.org" "Project")
         "* TODO %?\n")
        ("q" "Question" entry (file+headline "~/Dropbox/task.org" "Question")
         "* TODO %? :Question:\n")
        ("d" "Idea" entry (file+headline "~/Dropbox/task.org" "Idea")
         "* TODO %? :Idea:\n")))

;; Org tag
(setq org-tag-alist
      '(("Improvement" . ?i)
        (:startgrouptag)
        ("Must")
        (:grouptags)
        ("Homework" . ?h)
        ("Job" . ?j)
        (:endgrouptag)
        ("Personal" . ?p)
        ("Question" . ?q)
        ("Idea" . ?d)))
#+end_src

关于 Agenda 可以参考，在代码中创建了一个 "b" 视图，并且将紧急的事情，最近的
Deadline 较遥远的 Deadline 等整合到了一起。
#+begin_src emacs-lisp
;; Org agenda settings
(setq org-agenda-start-on-weekday nil
      org-agenda-skip-scheduled-if-deadline-is-shown t
      org-agenda-skip-deadline-prewarning-if-scheduled (quote pre-scheduled)
      org-agenda-skip-scheduled-if-done t
      org-agenda-skip-deadline-if-done t
      org-agenda-span 7
      org-agenda-compact-blocks t
      org-agenda-show-all-dates nil
      org-deadline-warning-days 365
      org-agenda-show-future-repeats t
      org-agenda-window-setup 'only-window)


(setq org-agenda-custom-commands
      '(("b" "Agenda View" ((tags "AGENDAHEADER"
                                  ((org-agenda-overriding-header "Today's Schedule:")))
                            (agenda ""
                                    ((org-agenda-show-all-dates t)
                                     (org-agenda-span 'day)
                                     (org-deadline-warning-days 0)
                                     (org-agenda-start-day "+0d")))
                            (todo "NEXT"
                                  ((org-agenda-overriding-header "========================================\nNext Tasks:")))
                            (tags-todo "Must/!-NEXT"
                                       ((org-agenda-overriding-header "========================================\nMust Do:")))
                            (tags "BEFOREWEEKGLANCE"
                                  ((org-agenda-overriding-header "========================================\nNext Week Glance:")))
                            (agenda ""
                                    ((org-agenda-show-all-dates t)
                                     (org-agenda-span 6)
                                     (org-agenda-start-day "+1d")))
                            (tags "BEFOREDEADLINE"
                                  ((org-agenda-overriding-header "========================================\nFar Away Tasks:")))
                            (agenda ""
                                    ((org-agenda-span 180)
                                     (org-agenda-time-grid nil)
                                     (org-agenda-show-all-dates nil)
                                     (org-agenda-entry-types '(:deadline :scheduled))
                                     (org-agenda-start-day "+7d")))))
        ("i" "Improvement" ((tags-todo "Question"
                                       ((org-agenda-overriding-header "Unsolved Questions:")))
                            (tags-todo "Improvement" ((org-agenda-overriding-header "\n\nImprovment:")))
                            (tags-todo "Idea+TODO<>\"NEXT\"|Personal+TODO<>\"NEXT\""
                                       ((org-agenda-overriding-header "\n\nPersonal Project:")))))))


#+end_src
*** GTD 补充
由于 Org-mode 本身并不带有更加可视化的视图以及提醒系统，我个人通过 org-icalendar
和 KOrganizer 来做到这一点。确切来说，在使用 Org-agenda 时会将目前的配置导出到
icalendar 文件中，然后再使用 KOrganizer 读取来达到目的。
#+begin_src emacs-lisp
;; ox-icalendar
(with-eval-after-load 'ox-icalendar
  (setq org-icalendar-combined-agenda-file (expand-file-name "~/Dropbox/agenda.ics")
        org-icalendar-include-todo t
        org-icalendar-use-deadline '(event-if-not-todo todo-due)
        org-icalendar-use-scheduled '(event-if-not-todo todo-start)
        org-icalendar-alarm-time 15
        org-icalendar-store-UID t
        org-agenda-default-appointment-duration 90))
(add-hook 'org-agenda-finalize-hook 'org-icalendar-combine-agenda-files)
#+end_src
*** Org-attach
attach 是将文件附与某个 headline 的方法，这样可以在 Org-mode 中将标题和文件关联
起来，可以看成是另一种 Link. 我定义了一个方法，这个方法可以在 org-agenda 中更快
地打开 attach 的文件，这也是它相对于一般的 Link 的优势所在。
#+begin_src emacs-lisp
;; Org attach
(setq org-attach-method 'lns)

(zenith/autoload '(org-attach org-attach-open) "org-attach")

(defun org-agenda-attach-open ()
  "Open attachment with one-key stroke."
  (interactive)
  (unless (eq major-mode 'org-agenda-mode)
    (let ((debug-on-quit nil))
      (signal 'quit '("This was written expressly for `*Org Agenda*`."))))
  (let ((marker (or (get-text-property (point) 'org-hd-marker)
                    (get-text-property (point) 'org-marker))))
    (if marker
        (save-excursion
          (set-buffer (marker-buffer marker))
          (goto-char marker)
          (org-back-to-heading t)
          (call-interactively 'org-attach-open))
      (error "No task in current line"))))
#+end_src
*** Org-id
一般的 Org-mode 之间的 Link 是依赖于文件结构的。这样当文件结构变化时其链接有可能
会失效，因此 Org-Mode 提供了 Org-id 这一模块来实现更加健壮的链接。
#+begin_src emacs-lisp
(setq org-id-track-globally t
      org-id-link-to-org-use-id t
      org-id-locations-file (expand-file-name ".org-id-locations" zenith-emacs-local-dir))

(with-eval-after-load 'org-id
  (setq org-id-extra-files (directory-files-recursively zenith/note-directory ".*\\.org"))
  (org-id-update-id-locations)
  (defun org-id-complete-link (&optional arg)
    "Create an id: link using completion"
    (concat "id:"
            (org-id-get-with-outline-path-completion org-refile-targets)))
  (org-link-set-parameters "id"
                           :complete 'org-id-complete-link)
  (defun zenith/search-id-reverse-link ()
    "Search the id in the directory"
    (interactive)
    (let ((query
           (cdr (first (org-entry-properties nil "ID")))))
      (rg-project query "*.org")))
  (defun zenith/org-insert-link-by-id ()
    "Insert the link by id"
    (interactive)
    (let ((link (org-link--try-special-completion "id")))
      (org-insert-link nil link))))
#+end_src
