content/post/emacs_configuration.md


### Org 与 LaTeX {#org-与-latex}

Org 有着非常丰富的导出选项，比如导出到 PDF，这一功能通过 LaTeX 实现。因此需要对
于 ox-latex 进行一定的配置。

```emacs-lisp
(with-eval-after-load 'ox-latex
  (add-to-list 'org-latex-classes
               '("myart"
                 "\\documentclass{article}
[DEFAULT-PACKAGES]
[PACKAGES]
\\usepackage[backend=biber,style=alphabetic]{biblatex}
\\addbibresource[location=local]{~/Dropbox/Library.bib}
\\setCJKmainfont{Source Han Sans CN}
\\setmonofont{Source Code Pro}
\\gappto{\\UrlBreaks}{\\UrlOrds}
"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
  (setq org-latex-compiler "xelatex"
        org-latex-default-class "myart"
        org-export-with-sub-superscripts nil
        org-latex-listings 'minted
        org-latex-minted-options '(("breaklines" "true")
                                   ("frame" "single")
                                   ("breakanywhere" "true"))
        org-latex-pdf-process
        '("latexmk -g -pdf -pdflatex=\"%latex\" -shell-escape -outdir=%o %f"))
  (setq org-latex-packages-alist '(("" "minted")
                                   ("" "xcolor")
                                   ("" "xeCJK")
                                   ("" "fontspec")
                                   ("" "etoolbox"))))
```


### org-download in WSL {#org-download-in-wsl}

由于一些 Windows 下所必须的软件，我有很多时候是在 WSL 中使用 Emacs，为了更好地在 WSL 中使用 org-download 我进行了一些必要的 Trick。首先要在 Windows 中安装 [IrfanView](https://www.irfanview.com/)。然后需要使用我的 init-wsl.el 文件，其中包含了对文件路径进行一定的处理的函数。最后，再修改一下 org-download-yank 以及 org-download-screenshot 函数即可。当然，最好用的 drag-and-drop 还是无法使用的。


## Emacs换行问题 {#emacs换行问题}

关闭 auto-fill-mode，使用 visual-line-mode，因为visual-line-mode在操作hjkl时更加直观。

```emacs-lisp
(remove-hook! org-mode
              #'auto-fill-mode)
(global-visual-line-mode)
```

现在我同时使用 auto-fill 和 visual-fill-column。事实上 auto-fill-mode 有很多的优
点，在自己编辑时会感觉更加舒服，但是问题在于 auto-fill 后的文件给别人就会不舒服。
这是 visual-fill-column 就派上了用场。

```emacs-lisp
(defun zenith/fill-and-indent-region ()
  "Fill paragraph and indent region at once"
  (interactive)
  (when (or
         (derived-mode-p 'text-mode)
         (nth 4 (syntax-ppss))
         (nth 8 (syntax-ppss)))
    (call-interactively 'fill-paragraph))
  (call-interactively 'indent-region))

;; visual fill column
(autoload 'visual-fill-column-mode "visual-fill-column" "" t)
(setq-default visual-fill-column-width (+ fill-column 20))
(add-hook 'visual-line-mode-hook 'visual-fill-column-mode)
(add-hook 'auto-fill-mode-hook 'visual-line-mode)
```


## 关于注释问题 {#关于注释问题}

Doom-emacs默认的注释插件是evil-commentary，但是我觉得evil-nerd-commenter <https://github.com/redguardtoo/evil-nerd-commenter> 更加便于使用，因为它能够toggle，注释和非注释状态。因此我使用evil-nerd-commenter取代了evil-commentary。

```emacs-lisp
;; evil-nerd-commenter
;; dependencies: evil
(zenith/autoload
 '(evilnc-comment-operator
   evilnc-comment-or-uncomment-lines
   evilnc-comment-or-uncomment-paragraphs
   evilnc-comment-or-uncomment-to-the-line
   evilnc-copy-and-comment-lines
   evilnc-copy-and-comment-operator
   evilnc-copy-to-line)
 "evil-nerd-commenter")
```

其中 zenith/autoload 是我自己写的一个函数是 autoload 的一个封装，可以同时对多个
函数进行 autoload。


## Evil-mode {#evil-mode}

由于我已经使用了个人的配置，就不得不对于 Evil-mode 来进行一番配置了，事实上使用
evil-collection 后基本上就按着默认来了。值得注意的是
<https://github.com/emacs-evil/evil-surround> 和
<https://github.com/redguardtoo/evil-matchit> 两个包，非常好用值得一试。

```emacs-lisp
;; evil
;; dependencies: undo-tree goto-chg
(setq evil-want-integration t  ; This is optional since it's already set to t by default.
      evil-want-keybinding nil ; loading keybindings
      evil-disable-insert-state-bindings t ; Use emacs's binding in insert state
      evil-want-C-d-scroll nil ; Use emacs's C-d
      evil-want-C-u-scroll nil ; Use emacs's C-u
      evil-want-C-i-jump t     ; Use vim's C-i
      evil-want-fine-undo t    ; Don not aggregate changes when exiting insert state
      evil-want-C-w-delete t   ; Use emacs's C-w
      evil-toggle-key ""       ; C-z not entering emacs state
      )

(require 'evil)

(evil-mode 1)
```


## 自动保存 {#自动保存}

Emacs 的保存非常反人类，不如让他自己来保存吧。不过这个功能最好和版本控制系统一起
使用，否则后果自负。这里调用了 evil 的 api， 每 2 秒没有操作就保存一次。

```emacs-lisp
;; The code is adjusted from https://github.com/manateelazycat/auto-save. The
;; problem of the original code is that it calls buffer-modified-p which makes
;; ws-butler unhappy.
(setq auto-save-idle 2)

(defun zenith/auto-save-buffers ()
  (interactive)
  (when (and
         (not (minibufferp))
         (or (not (boundp 'yas--active-snippets))
             (not yas--active-snippets))
         (or (not (boundp 'company-candidates))
             (not company-candidates)))
    (with-temp-message ""
      (let ((inhibit-message t))
        (evil-write-all nil)))))

(defun zenith/auto-save-enable ()
  (interactive)
  (run-with-idle-timer auto-save-idle t #'zenith/auto-save-buffers))

(zenith/auto-save-enable)
```
