src/Public.org
** UI
我使用了 https://github.com/seagle0128/doom-modeline ，总体而言还是非常好用的，
但是必须进行一定的 tweak 否则和 Org-mode 之间会有一定的冲突
#+begin_src emacs-lisp
;; Redefine `doom-modeline-redisplay' to ignore `doom-modeline--size-hacked-p'
;; to fix the problem caused by reuse of some buffer, for example *Org Tags*
(defun zenith/doom-modeline-always-redisplay ()
  "Check whether this buffer should always display"
  (or (string-equal (buffer-name) " *Org tags*")
      (string-equal (buffer-name) " *Org todo*")))
(defun doom-modeline-redisplay (&rest _)
  "Call `redisplay' to trigger mode-line height calculations.

Certain functions, including e.g. `fit-window-to-buffer', base
their size calculations on values which are incorrect if the
mode-line has a height different from that of the `default' face
and certain other calculations have not yet taken place for the
window in question.

These calculations can be triggered by calling `redisplay'
explicitly at the appropriate time and this functions purpose
is to make it easier to do so.

This function is like `redisplay' with non-nil FORCE argument.
It accepts an arbitrary number of arguments making it suitable
as a `:before' advice for any function.  If the current buffer
has no mode-line or this function has already been called in it,
then this function does nothing."
  (when (and (bound-and-true-p doom-modeline-mode)
             mode-line-format
             (not doom-modeline--size-hacked-p))
    (redisplay t)
    (unless (zenith/doom-modeline-always-redisplay)
      (setq doom-modeline--size-hacked-p t))))
#+end_src

除此之外，我对于 hl-line-mode 也进行了一定的定制。由于某些主体 highlight 的颜色
和 Mark 的颜色较为相似，造成分辨上的困难，我通过重定义使得在选择文本时关闭
hl-line-highlight。
#+begin_src emacs-lisp
;; Redefine `hl-line-highlight' to disable highlight line when selection is
;; active.
(defun hl-line-highlight ()
  "Activate the Hl-Line overlay on the current line."
  (if
      (and hl-line-mode	; Might be changed outside the mode function.
           (not (region-active-p)))
      (progn
        (unless hl-line-overlay
          (setq hl-line-overlay (hl-line-make-overlay))) ; To be moved.
        (overlay-put hl-line-overlay
                     'window (unless hl-line-sticky-flag (selected-window)))
	(hl-line-move hl-line-overlay))
    (hl-line-unhighlight)))
#+end_src
** 自动补全
自动补全使用的是 https://github.com/company-mode/company-mode 和
https://github.com/sebastiencs/company-box 。其中的配置可以参考
config/init-company.el 。事实上，在其中我自己实现了一个 company 的模糊匹配但是效
果不让人满意。

另一部分的自动补全是所谓的模板，模板使用的是
https://github.com/joaotavora/yasnippet。 同时我自己编写了一个插件实现模板的自动
展开，其要求是前一个单词以 , 开始然后按下空格键。函数会尝试展开，如果展开失败，
那么原封不动，如果展开成功，逗号就会消失。
#+begin_src emacs-lisp
;; Make yasnippet expandsion easy for me.
(defvar zenith/snippet-prefix ?,
  "The first character of expanding yasnippet")

(defun zenith/may-expand ()
  "Auto expand if the word before the point are started with
`zenith/snippet-prefix'. Return `t' if the expansion is successful
and `nil' otherwise."
  (interactive)
  (let* ((word-end (point))
         (word-start (save-excursion
                       (save-restriction
                         (narrow-to-region (line-beginning-position 0) (line-end-position))
                         (search-backward-regexp "^\\|[[:blank:]]\\|(\\|)\\|\\[\\|]\\|{\\|}" nil t))))
         (word)
         (len))

    (when word-start
      (if (eq (char-after word-start) zenith/snippet-prefix)
          (setq word (buffer-substring-no-properties word-start word-end))
        (setq
         word-start (+ word-start 1)
         word (buffer-substring-no-properties word-start word-end)))
      (when (eq zenith/snippet-prefix (string-to-char word))
        (delete-region word-start (+ word-start 1))
        (if (call-interactively 'yas-expand)
            t
          (setq len (- (length word) 1))
          (backward-char len)
          (insert-char zenith/snippet-prefix)
          (forward-char len)
          nil)))))

(defun zenith/post-command-hook ()
  "Check whether or not to expand after insertion of ~SPC~."
  (interactive)
  (when
      (and
       yas-minor-mode
       (eq last-command 'self-insert-command)
       (eq (char-before) ?\s))
    (delete-backward-char 1)
    (unless (zenith/may-expand)
      (insert-char ?\s)
      (when (boundp company-mode)
        (company-abort)))))

(define-minor-mode auto-expand-mode
  "Minor mode for zenith/may-expand"
  nil nil nil
  (if auto-expand-mode
      ;; Priority of the function should be high enough to run before fill
      ;; column
      (add-hook 'post-command-hook 'zenith/post-command-hook 0 t)
    (remove-hook 'post-command-hook 'zenith/post-command-hook t)))
(define-globalized-minor-mode global-auto-expand-mode auto-expand-mode auto-expand-mode-on)

(defun auto-expand-mode-on ()
  (auto-expand-mode 1))

(global-auto-expand-mode 1)
#+end_src
** Ivy-mode
https://github.com/abo-abo/swiper ivy, swiper, counsel 是强大的工具是对于 ido 的
加强。https://github.com/DarwinAwardWinner/amx 进一步加强了 execute-command。值
得提到的有两点，一是
#+begin_src emacs-lisp
(defun zenith/open-by-external-program (path)
  "Open file in external program"
  (let ((display-buffer-alist '(("*Async Shell Command*" . (display-buffer-no-window)))))
    (async-shell-command (format "nohup xdg-open \"%s\" >/dev/null 2>&1"
                                 (file-relative-name path default-directory)))))
#+end_src
这里个函数在 Linux 中通过系统默认的程序来打开文件。二是
#+begin_src emacs-lisp
;; https://github.com/tumashu/emacs-helper/commit/1932a9e8a64f08bb9603cf244df41f6c0bbc3dac
;; Search chinese with pinyin
(defun zenith/ivy-cregexp-helper (str)
  (cons (pyim-cregexp-build str) t))

(defun zenith/ivy-cregexp-ignore-order (str)
  (let ((str-list (split-string str)))
    (if str-list
      (mapcar 'zenith/ivy-cregexp-helper (split-string str))
      "")))

(setq ivy-re-builders-alist '((counsel-company . ivy--regex-fuzzy)
                              (t . zenith/ivy-cregexp-ignore-order)))

#+end_src
这样就可以在 ivy 的补全中直接使用拼音搜索，非常的好用。（事实上，在 ivy-posframe
中，pyim 莫名地不可用）
** Programming
编码主要依赖于https://github.com/flycheck/flycheck, 用于进行代码的事实检查。
https://github.com/manateelazycat/nox 用于和 LSP Server 通信提供补全跳转等编码体
验，https://github.com/lassik/emacs-format-all-the-code 提供代码格式化。同时
https://github.com/bbatsov/projectile 提供了项目管理（事实上这一功能我用的比较少）。
