src/Public.org
** 琐碎
show-paren-mode 可以显示配对的括号。recentf 提供访问最近文件的方法。cua-mode 使
得 C-x, C-c, C-v 有和其他软件类似的行为。display-line-number-mode 是高效的显示行
号的方法。 winner-mode 提供对于 window 操作的撤销和重做。undo-tree 提供了非常好
的撤销， https://github.com/Fuco1/smartparens 提供括号和命令的补全。
https://github.com/lewang/ws-butler 以一种友好的方式去除行末空格。
https://github.com/abo-abo/ace-window 提供窗口切换的好方法。rg 提供快速的文本搜
索，和 wgrep 配合提供文本的替换。https://github.com/raxod502/ctrlf 增强了 Emacs
自带的搜索，使得行为更加可控。https://github.com/redguardtoo/wucuo 提供了快速的
拼写检查。 shackle 提供了对于弹出窗口的控制。
https://github.com/noctuid/general.el 提供了绑定快捷键的好方法。
https://github.com/justbur/emacs-which-key 提供了探索快捷键的方法。除此之外，我
还自己写了几个函数。
#+begin_src emacs-lisp
;; Delete word in a more user friendly way
(defun zenith/aggressive-delete-space ()
  "Remove all the space until non-space character."
  (interactive)
  (let ((end (point))
        (begin (save-excursion
                 (re-search-backward "[^ \t\n\r]" nil t))))
    (delete-region (+ 1 begin) end)))

(defun zenith/delete-word-or-space ()
  "Remove all the space until non-space character if the char at
point and before are all space characters and delete word
otherwise."
  (interactive)
  (if (and (zenith/is-space (char-before))
           (zenith/is-space (char-before (- (point) 1))))
      (zenith/aggressive-delete-space)
    (backward-kill-word 1)))
#+end_src
zenith/aggressive-delete-space 使得删除词的行为更精细。
#+begin_src emacs-lisp
;; jump in my way
(defvar zenith/jump-function-alist
  '((org-mode . org-goto)
    (latex-mode . reftex-toc)
    (org-agenda-mode . org-agenda-redo)
    (t . counsel-imenu))
  "The function to call when jump")

(defun zenith/jump ()
  "Jump as `zenith/jump-function-alist' like."
  (interactive)
  (if-let ((func (alist-get major-mode zenith/jump-function-alist)))
      (funcall func)
    (funcall (alist-get t zenith/jump-function-alist))))
#+end_src
zenith/jump 提供了浏览文件的统一方法。

